Revit 2027 API
ParameterTypeId.CurveEdgeOffset Property
 "Wall offset"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId CurveEdgeOffset { get; }
Public Shared ReadOnly Property CurveEdgeOffset As ForgeTypeId
	Get
public:
static property ForgeTypeId^ CurveEdgeOffset {
	ForgeTypeId^ get ();
}
static member CurveEdgeOffset : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace